# Lesen & Schreiben von Daten

- Lesen Allgemein
- St√ºckweise lesen

## Lesen allgemein:

- header = ...
- skioprows = range(0,x)
- names = [' ']
- index_col = ' '

- na_values = ['']
- pd.isnull(df)

In [111]:
import pandas as pd

%pwd

'D:\\Users\\Dura\\Documents\\Programmieren\\python\\Data Analysis\\Buch-Datenanalyse'

In [112]:
# relative or abolute path

# df = pd.read_csv('D:\\Users\\Dura\\Documents\\Programmieren\\python\\Data Analysis\\Buch-Datenanalyse\\examples\\ex1.csv')
# df = pd.read_csv('.\\examples\\ex1.csv')
df = pd.read_csv('examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [135]:
# define seperator
df2 = pd.read_csv('examples/ex1.csv', sep = ',')

# ignore header
df3 = pd.read_csv('examples/ex1.csv', header = None)

# define column-names
# df4 = pd.read_csv('examples/ex1.csv', skiprows = lambda x: x in [0, 2], names = ['k', 'l','m','n','text'])
# df4 = pd.read_csv('examples/ex1.csv', skiprows =  [0, 2], names = ['k', 'l','m','n','text'])
df4 = pd.read_csv('examples/ex1.csv', skiprows =  range(0,0), names = ['k', 'l','m','n','text'])

In [137]:
x = range(-2,15,3)
y = range(0,3)

'''
for i in x:
    print(i)
'''

'\nfor i in x:\n    print(i)\n'

In [115]:
# column as index 
pd.read_csv('examples/ex1.csv', names = ['k', 'l','m','n','text'], index_col = 'text')

         k   l   m   n
text
message  a   b   c   d
 hello   1   2   3   4
world    5   6   7   8
 foo     9  10  11  12

In [119]:
# hierarchical Index
display(pd.read_csv('examples/mindex.txt').head(2))
display(pd.read_csv('examples/mindex.txt',index_col=['key1','key2']).head())

  key1 key2  value1   value2
0  one    a       1        2
1  one    b       3        4

           value1   value2
key1 key2
one  a          1        2
     b          3        4
     c          5        6
     d          7        8
two  a          9       10

In [153]:
# Sentinel-Values (Missing values)
# na_values defines which values are interpreted as NA / NaN

result2 = pd.read_csv('examples/ex2.csv')
result3 = pd.read_csv('examples/ex2.csv', na_values = ['foo'])
result4 = pd.read_csv('examples/ex5.csv', na_values = ['foo'])

display(result2)
display(result4)
display(pd.isnull(result))

  something  a    b     c   d  message
0       one  1  2.0   3.0   4      NaN
1       two  5  6.0   NaN   8    world
2     three  9  NaN  11.0  12      foo

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

     one    two  three   four    key
0  False  False  False  False  False
1  False  False  False  False  False
2  False  False  False  False  False
3  False  False  False  False  False
4  False  False  False  False  False

## St√ºckweise Lesen

- nrows
- chunksize > iterate

In [147]:
result = pd.read_csv('examples/ex6.csv', nrows = 5)
chunk = pd.read_csv('examples/ex6.csv', chunksize = 100)
result

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

## Daten scheiben

- sep = ' '
- na_rep = ' '
- index  = False / True
- header = False / True
- columns = [' ', ' ', ... ]

In [148]:
df5 = pd.read_csv('examples/ex5.csv')
df5

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [155]:
df5.to_csv('examples/out_ex5_1.csv')
df5.to_csv('examples/out_ex5_2.csv', header = False)
df5.to_csv('examples/out_ex5_3.csv', header = False, index = False, columns = ['message','c','something'], na_rep = 'nix')
df5.to_csv('examples/out_ex5_4.csv')

## Schlecht formatierte Daten selber formatieren

- Einlesen
- Iterieren ueber Zeilen

In [175]:
import csv

f = open('examples/ex7.csv')
display(f)

reader = csv.reader(f)
display(reader)

for zeilen in reader:
    print(zeilen)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

**1. Werte in Liste speichern**

In [182]:
# WICHTIG!!!
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

**2. In Kopf- und Datenzeile aufteilen**

In [183]:
header = lines[0]
values = lines[1:]

['a', 'b', 'c']

[['1', '2', '3'], ['1', '2', '3']]